# Python Pandas

Pandas is an open-source Python Library providing high-performance data manipulation and analysis tool using its powerful data structures. The name Pandas is derived from the word Panel Data â€“ an Econometrics from Multidimensional data.

In [1]:
import pandas as pd
import numpy as np
import os

### 1. Series:

- Creation of series
- Handling data types

In [15]:
# Series from arrays:
arr1 = np.array(['i','n','d','i','a'])
series1 = pd.Series(arr1)
print(series1)

# Series from lists:
list1 = ['i','s']
series1 = pd.Series(list1)
print(series1)

# Data type conversion
s1 = pd.Series([1,2,'2',3])
print(s1.dtypes)
print(s1.astype('int'))


s1 = pd.Series([1,2,'2a',3])
print(s1.dtypes)
print(s1.astype('object'))

s1 = pd.to_numeric([1,2,'2a',3], errors='coerce')
print(s1)

s1 = pd.Series([1,2,'2a',3])
print(s1.dtypes)
print(s1.astype('int'))

0    i
1    n
2    d
3    i
4    a
dtype: object
0    i
1    s
dtype: object
object
0    1
1    2
2    2
3    3
dtype: int64
object
0     1
1     2
2    2a
3     3
dtype: object
[ 1.  2. nan  3.]
object

ValueError: invalid literal for int() with base 10: '2a'

### 2. Creation of DataFrame:

In [24]:
list1 = [24,26,27]
list2 = ['abd','bde','ace']

print(pd.DataFrame(list1))
print(pd.DataFrame([list1]))
print(pd.DataFrame([list1,list2]))
print(pd.DataFrame(list1,list2))

pd.DataFrame({'list1':list1,
            'list2':list2})

    0
0  24
1  26
2  27
    0   1   2
0  24  26  27
     0    1    2
0   24   26   27
1  abd  bde  ace
      0
abd  24
bde  26
ace  27

   list1 list2
0     24   abd
1     26   bde
2     27   ace

In [122]:
df1 = pd.DataFrame({'Items': [10, 5, 2],
                    'Price': [20, 5, 30],
                    'Qty': [2,10,12]},index=[1,2,3])
df1

   Items  Price  Qty
1     10     20    2
2      5      5   10
3      2     30   12

### 3. Indexing / Slicing:

In [123]:
df1[['Items']]
df1['Items']
df1.loc[1]
df1.iloc[1]

df1[['Items','Price']]
df1.loc[[1,2]]

df1.loc[[1,2],:]
df1.loc[:,['Items','Price']]

df1.loc[[1,2],['Items','Price']]

#df1.iloc[[1,2],['Items','Price']]

df1.iloc[[1,2],[0,1]]

df1.Items
df1.loc[df1['Items']>2,:]
df1['Items']>2

1     True
2     True
3    False
Name: Items, dtype: bool

### 4. Iterating over rows and columns:

In [69]:
# iterating over rows using iterrows() function 
for i in df1.iterrows():
    print(i)
    
for i,j in df1.iterrows():
    print(i)
    print(j)

(1, Items    10
Price    20
Qty       2
Name: 1, dtype: int64)
(2, Items     5
Price     5
Qty      10
Name: 2, dtype: int64)
(3, Items     2
Price    30
Qty      12
Name: 3, dtype: int64)
1
Items    10
Price    20
Qty       2
Name: 1, dtype: int64
2
Items     5
Price     5
Qty      10
Name: 2, dtype: int64
3
Items     2
Price    30
Qty      12
Name: 3, dtype: int64

In [72]:
for i in df1.columns:
    print(df1[i])
    print(i)

1    10
2     5
3     2
Name: Items, dtype: int64
Items
1    20
2     5
3    30
Name: Price, dtype: int64
Price
1     2
2    10
3    12
Name: Qty, dtype: int64
Qty

### 5. Methods for DataFrames:

- index()
- add() / sub() / mul() / div()
- unique() / nunique()
- value_counts()
- isin()
- shape(), dtypes(), describe()
- head(), tail()
- rename()
- drop(), pop()
- insert
- copy()
- concat()
- duplicated(), drop_duplicates()

In [124]:
df1.index

df1.add(1)

df1.add(df1)

df1.mul(10)

df1['Items'].unique()

df1['Items'].nunique()

df1['Items'].value_counts()

df1['Items'].isin([10])

df1.shape

df1.dtypes

df1.describe()

df1.describe(include='all')

df1.head(2)

df1.tail(2)

   Items  Price  Qty
2      5      5   10
3      2     30   12

In [134]:
df1.rename(columns = {'Items':'Item_no'},inplace=True)
df1

   Item_no  Price  Qty
1       10     20    2
2        5      5   10
3        2     30   12

In [126]:
df1.rename(index = {1:0},inplace=True)
df1

   Item_no  Price  Qty
0       10     20    2
2        5      5   10
3        2     30   12

In [135]:
df1.pop('Item_no')

1    10
2     5
3     2
Name: Item_no, dtype: int64

In [136]:
df1

   Price  Qty
1     20    2
2      5   10
3     30   12

In [152]:
df1 = pd.DataFrame({'Items': [10, 5, 2],
                    'Price': [20, 5, 30],
                    'Qty': [2,10,12]},index=[1,2,3])

In [146]:
df1.drop(['Items'],axis=1)

df1.drop([1,2],axis=0)

df1.drop(['Items'],axis=1,inplace=True)
df1

   Price  Qty
1     20    2
2      5   10
3     30   12

In [147]:
df1.insert(1,'Items',[10, 5, 2])
df1

   Price  Items  Qty
1     20     10    2
2      5      5   10
3     30      2   12

In [149]:
df2 = df1

In [150]:
df2.loc[1,:] = [2,3,4]

In [151]:
df1

   Price  Items  Qty
1      2      3    4
2      5      5   10
3     30      2   12

In [154]:
df2 = df1.copy()
df2.loc[1,:] = [2,3,4]
df1

   Items  Price  Qty
1     10     20    2
2      5      5   10
3      2     30   12

In [155]:
df2

   Items  Price  Qty
1      2      3    4
2      5      5   10
3      2     30   12

In [179]:
# Cbind
pd.concat([df1,df1.loc[:,['Items']]],axis=1)

# Rbind
pd.concat([df1,df1.loc[[1],:]],axis=0)
df1 = pd.concat([df1,df1.loc[[1],:]],axis=0)
df1

In [184]:
df1.duplicated()

df1.loc[df1.duplicated(),:]

df1.drop_duplicates()

   Items  Price  Qty
1     10     20    2
2      5      5   10
3      2     30   12

### 6. Merge data frames:

In [185]:
marks = pd.read_csv('Marks.csv')
exam = pd.read_csv('Exam.csv')

In [186]:
final_df = pd.merge(marks,exam,how='left',left_on='Studen ID',right_on='Student ID')
final_df.head()

,Studen ID,Subject A,Subject B,Subject C,Subject D,Subject E,Student ID,Exam
0,1,76,85,31,81.0,38,1,March
1,2,34,32,43,89.0,61,2,March
2,3,89,53,78,55.0,76,3,March
3,4,58,78,90,38.0,54,4,September
4,5,68,NaN,85,64.0,73,5,March

In [187]:
final_df.Exam.unique()

array(['March', 'September', nan, 'March ', '?'], dtype=object)

### 7. Groupby for aggregation:

In [191]:
final_df.Exam.value_counts()
final_df.Exam.replace(['?','March '],'March',inplace=True)
final_df.Exam.value_counts()

March        18
September    11
Name: Exam, dtype: int64

In [192]:
final_df.groupby(['Exam'])['Subject D'].mean()

Exam
March        61.222222
September    55.600000
Name: Subject D, dtype: float64

### 8. Apply function for iteration:

In [197]:
final_df[['Subject D','Subject C']].apply(lambda x: x.mean(),axis=1)
final_df[['Subject D','Subject C']].apply(lambda x: x.mean(),axis=0)

Subject D    59.827586
Subject C    56.966667
dtype: float64

### 9. Reshape the data frame:

In [259]:
df1 = pd.DataFrame({'id' : (1,1,2,2),
                 'time' : (1,2,1,2),
                 'x1' : (5,3,6,2),
                 'x2' : (6,5,1,4)})
df1

   id  time  x1  x2
0   1     1   5   6
1   1     2   3   5
2   2     1   6   1
3   2     2   2   4

In [260]:
df1 = pd.melt(df1, id_vars=['id','time'], value_vars=['x1','x2'],value_name='heartbeat',var_name='x')
df1

   id  time   x  heartbeat
0   1     1  x1          5
1   1     2  x1          3
2   2     1  x1          6
3   2     2  x1          2
4   1     1  x2          6
5   1     2  x2          5
6   2     1  x2          1
7   2     2  x2          4

In [261]:
df1 = df1.pivot_table(index=['id','time'], columns='x', aggfunc= lambda x: x)
df1

        heartbeat
x              x1 x2
id time
1  1            5  6
   2            3  5
2  1            6  1
   2            2  4

In [262]:
df1 = df1.reset_index(col_level=1)
df1.columns  = df1.columns.droplevel(0)
df1

x  id  time  x1  x2
0   1     1   5   6
1   1     2   3   5
2   2     1   6   1
3   2     2   2   4